 # Pandas

In [1]:
import pandas as pd
import numpy as np

ls = [1,2,3,4]
arr = np.array(ls)
ser = pd.Series(arr)
print(ls)
print(arr)
print(ser)

[1, 2, 3, 4]
[1 2 3 4]
0    1
1    2
2    3
3    4
dtype: int64

In [2]:
d = {
    "Name":["Ann","Sara","Ahmed"],
    "ID":[1,2,3],
    "Score": [89,95,100]
}
df =pd.DataFrame(d)
df

    Name  ID  Score
0    Ann   1     89
1   Sara   2     95
2  Ahmed   3    100

In [ ]:
df = pd.read_excel('catalog.xlsx')    #  excel ni ukish
df.head(10)